# Distance3D

## Description
Returns the 3D distance between two points. Same as Norm.

```pascal
FUNCTION Distance3D(
				x1 : REAL;
				y1 : REAL;
				z1 : REAL;
				x2 : REAL;
				y2 : REAL;
				z2 : REAL) : REAL;
```

```python

def vs.Distance3D(x1, y1, z1, x2, y2, z2):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|x1|REAL||
|y1|REAL||
|z1|REAL||
|x2|REAL||
|y2|REAL||
|z2|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation